# merge

In [6]:
import pandas as pd

# Creating two sample DataFrames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2'],
                    'key': ['K0', 'K1', 'K2']})

df2 = pd.DataFrame({'C': ['C0', 'C1', 'C2'],
                    'D': ['D0', 'D1', 'D2'],
                    'key': ['K0', 'K1', 'K2']})

# Merging based on the 'key' column
merged_df = pd.merge(df1, df2, on="key")
print(merged_df)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

# Concatenate

In [2]:
# Concatenating along rows
concatenated_df = pd.concat([df1, df2])
print(concatenated_df)

     A    B key    C    D
0   A0   B0  K0  NaN  NaN
1   A1   B1  K1  NaN  NaN
2   A2   B2  K2  NaN  NaN
0  NaN  NaN  K0   C0   D0
1  NaN  NaN  K1   C1   D1
2  NaN  NaN  K2   C2   D2

# group by

In [7]:
# Creating a DataFrame
data = {'Team': ['Arsenal', 'Man Utd', 'Chelsea', 'Arsenal', 'Man Utd'],
        'Player': ['A', 'B', 'C', 'D', 'E'],
        'Goals': [5, 7, 3, 4, 8]}
df = pd.DataFrame(data)

# Grouping by 'Team' and calculating the sum of goals for each team
grouped_df = df.groupby('Team').sum()
print(grouped_df)

        Player  Goals
Team
Arsenal     AD      9
Chelsea      C      3
Man Utd     BE     15

# spliting

In [8]:
# Splitting the DataFrame into groups based on the 'Team' column and applying a function to calculate the maximum goals
max_goals_by_team = df.groupby('Team')['Goals'].max()
print(max_goals_by_team)

Team
Arsenal    5
Chelsea    3
Man Utd    8
Name: Goals, dtype: int64

# combining

In [9]:
# Combining two DataFrames with overlapping indexes
combined_df = df1.combine_first(df2)
print(combined_df)

    A   B   C   D key
0  A0  B0  C0  D0  K0
1  A1  B1  C1  D1  K1
2  A2  B2  C2  D2  K2

# Reshaping, Unstacking, and Pivot Tables

In [10]:
# Creating a DataFrame
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['small', 'large', 'large', 'small', 'small', 'large'],
        'D': [1, 2, 2, 3, 3, 4]}
df = pd.DataFrame(data)

# Reshaping the DataFrame using pivot table
pivot_table = df.pivot_table(values='D', index=['A', 'B'], columns='C', aggfunc='sum')
print(pivot_table)

C        large  small
A   B
bar one    4.0    3.0
    two    NaN    3.0
foo one    2.0    1.0
    two    2.0    NaN

In [11]:
pivot_table

C        large  small
A   B
bar one    4.0    3.0
    two    NaN    3.0
foo one    2.0    1.0
    two    2.0    NaN

# more

In [13]:
# Inner join
inner_join = pd.merge(df1, df2, on='key', how='inner')
inner_join

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [14]:
# Outer join
outer_join = pd.merge(df1, df2, on='key', how='outer')
outer_join

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [15]:
# Left join
left_join = pd.merge(df1, df2, on='key', how='left')
left_join

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [16]:
# Right join
right_join = pd.merge(df1, df2, on='key', how='right')
right_join

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [20]:
#Grouping By:
import numpy as np 
import pandas as pd 

df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one -0.805553  1.633230
1  bar    one -0.619512 -0.595762
2  foo    two -0.179899  0.057437
3  bar  three  0.280000 -0.671210
4  foo    two -1.838316  0.491009
5  bar    two  0.898290  2.505314
6  foo    one  0.325808 -0.015013
7  foo  three -0.851557 -0.649910

In [21]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.558778  1.238342
foo -3.349517  1.516754

In [22]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.619512 -0.595762
    three  0.280000 -0.671210
    two    0.898290  2.505314
foo one   -0.479746  1.618218
    three -0.851557 -0.649910
    two   -2.018215  0.548447

# multi index

In [23]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]


index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

df2 = df[:4]

df2

                     A         B
first second
bar   one     0.827439  1.376437
      two    -0.408426  0.123925
baz   one    -0.636556 -0.648775
      two    -0.628590  1.258092

In [24]:
stacked = df2.stack(future_stack=True)

stacked

first  second
bar    one     A    0.827439
               B    1.376437
       two     A   -0.408426
               B    0.123925
baz    one     A   -0.636556
               B   -0.648775
       two     A   -0.628590
               B    1.258092
dtype: float64